Revit 2027 API
ElementSet.Insert Method
Insert the specified element into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	Element item
)
Public Overridable Function Insert (
	item As Element
) As Boolean
public:
virtual bool Insert(
	Element^ item
)
abstract Insert :
        item : Element -> bool
override Insert :
        item : Element -> bool
Parameters
item Element
The element to be inserted into the set.
Return Value
Boolean
Returns whether the element was inserted into the set.
See Also
Reference
ElementSet Class
Autodesk.Revit.DB Namespace